// Завдання: Написати програму яка буде перевіряти чи рік народження
// користувача був високосним
// Наприклад: 2000, 2004, 2016 - високосні 
//1998,2002, 1900 2100 - не високосні

let year = prompt("Введите ваш год рождения", " ");
if (year % 4 !== 0) {
  alert("Год вашего рождения - не высокосный");
} else if (year % 100 !== 0) {
  alert("Год вашего рождения - высокосный");
} else if (year % 100 == 0 && year % 400 == 0) {
  alert("Год вашего рождения - высокосный");
} else {
  alert("Год вашего рождения - не высокосный");
}
  