// Написати програму яка переведе введену оцінку студента до
// болонського формату 89 - 100 це A 75 - 88 це В 60 - 74 це С 45 -
// 59 це D 20 - 44 це Е до 20 це F

let i = +prompt("Введите оценку студента", " ");
if (i >= 89 && i <= 100) {
  alert("Ваша оценка по болонской системе = А");
} else if (i >= 75 && i <= 88) {
  alert("Ваша оценка по болонской системе = B");
} else if (i >= 60 && i <= 74) {
  alert("Ваша оценка по болонской системе = C");
} else if (i >= 45 && i <= 59) {
  alert("Ваша оценка по болонской системе = D");
} else if (i >= 20 && i <= 44) {
  alert("Ваша оценка по болонской системе = E");
} else {
  alert("Ваша оценка по болонской системе = F");
}
