// Написати програму де компютер загадає число від 1 до 10 і
// запропонує користувачу вгадати його Користувач вводить свій
//  варіант і отримує результат (Виграв чи ні) Вивести результат в
//  форматі "Вітаю ви вгадали число (тут варіант компютера)" або "Ви
// програли, компютер загадав (тут варіант компютера)"

let secretNumber = Math.random();
secretNumber = Math.floor(Math.random() * (0 + 10) + 1);
console.log(secretNumber);
let myNumber = +prompt(
  "Угадайте число, которое загадал компьютер",
  "Введите число"
);
if (secretNumber == myNumber) {
  alert(`Поздравляю! Вы угадали число ${myNumber}`);
} else {
  alert(`Вы проиграли! Компьютер загадал число ${secretNumber}`);
}